Revit 2026 API

# TextNoteTextNoteType Property

---

Access the type of the TextNote object.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public TextNoteType TextNoteType { get; set; }
```
```vb
Public Property TextNoteType As TextNoteType
	Get
	Set
```
```cpp
public:
property TextNoteType^ TextNoteType {
	TextNoteType^ get ();
	void set (TextNoteType^ value);
}
```
```fsharp
member TextNoteType : TextNoteType with get, set
```

#### Property Value

TextNoteType

The type of the TextNote object can be retrieved or changed.

#### Reference

TextNote Class

Autodesk.Revit.DB Namespace